Tekla.Structures.Model.BoltPolygon
Bolt Polygon represents a polygon object that has its corners at the given points.

Tekla.Structures.Model.BoltPolygon.#ctor
Initializes a new instance of the Bolt Polygon class with empty attributes.

Tekla.Structures.Model.BoltPolygon.ToStruct(Tekla.Structures.ModelInternal.dotBoltPolygon_t@)
P:

Tekla.Structures.Model.BoltPolygon.FromStruct(Tekla.Structures.ModelInternal.dotBoltPolygon_t@)
Polygon:

Tekla.Structures.Model.BoltPolygon.Points
The corners of the bolt polygon.